config.org
** Magit
#+BEGIN_SRC emacs-lisp
(use-package! magit-delta
  :after magit
  :when (executable-find "delta")
  :config
  (setq magit-delta-hide-plus-minus-markers nil
        magit-delta-default-dark-theme "Nord"
        magit-delta-default-light-theme "Github")
  (magit-delta-mode))
#+END_SRC

* UI
** Font
I like the iosevka font family for programming, and I like the 'quasi-spaced'
options like Etoile/Sparkle for variable pitch stuff -- real variable pitch
fonts are a little jarring imo when switching between buffers or embedding
something monospaced (like in this config) so duo-spaced style font doesn't have
that problem but is still more readable.

#+BEGIN_SRC emacs-lisp :lexical yes
(setq doom-font                       (font-spec
                                       :family "Iosevka Extended"
                                       :size 16)
      doom-variable-pitch-font        (font-spec
                                       :family "Iosevka Sparkle"
                                       :size 16)
      +zen-text-scale                 0
      +latex-viewers                  (if IS-MAC '(pdf-tools))
      +pretty-code-enabled-modes      '(org-mode))
#+END_SRC
** Dashboard
*** Dashboard ASCII-art
  Modified `doom-dashboard-widget-banner' with ascii art lifted from https://github.com/plexus/chemacs. It looks better without all the double backslashes, promise.
#+BEGIN_SRC emacs-lisp
(defun +my/doom-dashboard-widget-banner ()
  (let ((point (point)))
    (mapc (lambda (line)
            (insert (propertize (+doom-dashboard--center +doom-dashboard--width line)
                                'face 'doom-dashboard-banner) " ")
            (insert "\n"))
          '(""
            "       ___           ___           ___           ___           ___      "
            "      /  /\\         /__/\\         /  /\\         /  /\\         /  /\\     "
            "     /  /:/_       |  |::\\       /  /::\\       /  /:/        /  /:/_    "
            "    /  /:/ /\\      |  |:|:\\     /  /:/\\:\\     /  /:/        /  /:/ /\\   "
            "   /  /:/ /:/_   __|__|:|\\:\\   /  /:/ /::\\   /  /:/  ___   /  /:/ /::\\  "
            "  /__/:/ /:/ /\\ /__/::::| \\:\\ /__/:/ /:/\\:\\ /__/:/  /  /\\ /__/:/ /:/\\:\\ "
            "  \\  \\:\\/:/ /:/ \\  \\:\\     \\/ \\  \\:\\/:/__\\/ \\  \\:\\ /  /:/ \\  \\:\\/:/ /:/ "
            "   \\  \\::/ /:/   \\  \\:\\        \\  \\::/       \\  \\:\\  /:/   \\  \\::/ /:/  "
            "    \\  \\:\\/:/     \\  \\:\\        \\  \\:\\        \\  \\:\\/:/     \\__\\/ /:/   "
            "     \\  \\::/       \\  \\:\\        \\  \\:\\        \\  \\::/        /__/:/    "
            "      \\__\\/         \\__\\/         \\__\\/         \\__\\/         \\__\\/     "
            ""
            ""
            ""
            ""))
    (when (and (display-graphic-p)
               (stringp fancy-splash-image)
               (file-readable-p fancy-splash-image))
      (let ((image (create-image (fancy-splash-image-file))))
        (add-text-properties
         point (point) `(display ,image rear-nonsticky (display)))
        (save-excursion
          (goto-char point)
          (insert (make-string
                   (truncate
                    (max 0 (+ 1 (/ (- +doom-dashboard--width (car (image-size image nil)))
                                   2)))) 32))))
      (insert (make-string (or (cdr +doom-dashboard-banner-padding) 0) 10)))))
#+END_SRC
**** TODO screenshots
*** Dashboard shortcuts, icons
#+BEGIN_SRC emacs-lisp
(add-hook! +doom-dashboard-mode (hl-line-mode -1))
(setq! +doom-dashboard-menu-sections
       '(("Reload last session"
          :icon (all-the-icons-octicon "history" :face 'doom-dashboard-menu-title)
          :when (cond ((require 'persp-mode nil t)
                       (file-exists-p (expand-file-name persp-auto-save-fname persp-save-dir)))
                      ((require 'desktop nil t)
                       (file-exists-p (desktop-full-file-name))))
          :face (:inherit (doom-dashboard-menu-title bold))
          :action doom/quickload-session)
         ("Open today's note"
          :icon (all-the-icons-octicon "book" :face 'doom-dashboard-menu-title)
          :action org-roam-dailies-today)
         ("Recently opened files"
          :icon (all-the-icons-octicon "file-text" :face 'doom-dashboard-menu-title)
          :action recentf-open-files)
         ("Open project"
          :icon (all-the-icons-octicon "repo" :face 'doom-dashboard-menu-title)
          :action projectile-switch-project)
         ("Jump to bookmark"
          :icon (all-the-icons-octicon "bookmark" :face 'doom-dashboard-menu-title)
          :action bookmark-jump)
         ("Open private configuration"
          :icon (all-the-icons-octicon "tools" :face 'doom-dashboard-menu-title)
          :when (file-directory-p doom-private-dir)
          :action doom/open-private-config))

       +doom-dashboard-functions '(+my/doom-dashboard-widget-banner
                                   doom-dashboard-widget-shortmenu
                                   doom-dashboard-widget-loaded))

#+END_SRC
** Misc. appearance/display
#+BEGIN_SRC emacs-lisp
(setq solaire-mode-auto-swap-bg       t
      solaire-mode-remap-line-numbers t

      which-key-side-window-location  'bottom
      which-key-sort-order            'which-key-key-order-alpha
      which-key-max-description-length nil

      display-line-numbers-type       'nil

      evil-split-window-below         t
      evil-vsplit-window-right        t

      doom-modeline-persp-name t
      doom-modeline-major-mode-icon t)

(remove-hook! text-mode hl-line-mode)
(toggle-frame-fullscreen)
(if IS-MAC (toggle-frame-fullscreen))
#+END_SRC

** Theme
*** Set theme by time
Currently I'm still really liking oceanic next, but if/when that gets old
changing ~+my/override-theme~ to nil will have this snippet will choose randomly
from a selection of light themes or dark themes, depending on the time of day.
#+BEGIN_SRC emacs-lisp :lexical yes
(setq! +my/themes-list-dark      '(doom-gruvbox
                                   doom-oceanic-next
                                   doom-nord
                                   doom-wilmersdorf
                                   doom-city-lights
                                   doom-moonlight)
       +my/themes-list-light     '(doom-gruvbox-light
                                   doom-nord-light
                                   doom-acario-light
                                   doom-solarized-light)
       doom-gruvbox-dark-variant 'soft
       doom-gruvbox-light-variant 'soft
       +my/override-theme     'doom-gruvbox ;;-light
       doom-theme                (or +my/override-theme
                                     (let ((hour (caddr (decode-time nil)))
                                           (sec (car (decode-time nil))))
                                       (let ((theme-choices
                                              (if (<= 9 hour 15)
                                                  +my/themes-list-light
                                                +my/themes-list-dark)))
                                         (nth (mod sec (length theme-choices))
                                              theme-choices)))))
#+END_SRC
**** TODO open pull request for doom-themes
* Keybindings
** keybinding-related variables
#+BEGIN_SRC emacs-lisp :lexical yes
(setq  doom-leader-key "SPC"
       doom-leader-alt-key "C-SPC"
       doom-localleader-key ","
       doom-localleader-alt-key "C-,")
#+END_SRC

#+BEGIN_SRC emacs-lisp :lexical yes
(use-package! expand-region
  :config
  (setq expand-region-contract-fast-key "V"))
#+END_SRC

#+BEGIN_SRC emacs-lisp :lexical yes
(use-package! evil-snipe
  :init
  (setq evil-snipe-scope                     'whole-visible
        evil-snipe-spillover-scope           'whole-buffer
        evil-snipe-repeat-scope              'buffer
        evil-snipe-tab-increment             t
        evil-snipe-repeat-keys               t
        evil-snipe-override-evil-repeat-keys t)
  :config
  ;; when f/t/s searching, interpret open/close square brackets to be any
  ;; open/close delimiters, respectively
  (push '(?\[ "[[{(]") evil-snipe-aliases)
  (push '(?\] "[]})]") evil-snipe-aliases)
  (evil-snipe-override-mode +1))
#+END_SRC
