config.el

(defun +my/avy-evil-snipe-repeat ()
  (interactive)
  (if evil-snipe--last
      (apply #'avy-goto-char-2 (nth 1 evil-snipe--last))
    (call-interactively #'avy-goto-char-2)))

(map! :after evil-snipe
      :map (evil-snipe-parent-transient-map evil-snipe-local-mode-map)
      "C-;" #'+my/avy-evil-snipe)

(map! :n [tab] (general-predicate-dispatch nil
                   (and (featurep! :editor fold)
                        (save-excursion (end-of-line) (invisible-p (point))))
                   #'+fold/toggle
                   (fboundp 'evil-jump-item)         #'evil-jump-item)
;;; ^^ borrowed from hlissner's config, tab to unfold
        :v [tab] (general-predicate-dispatch nil
                   (and (bound-and-true-p yas-minor-mode)
                        (or (eq evil-visual-selection 'line)
                            (not (memq (char-after) (list ?\( ?\[ ?\{ ?\} ?\] ?\))))))
                   #'yas-insert-snippet
                   (fboundp 'evil-jump-item)         #'evil-jump-item)
        (:when (featurep! :ui workspaces)
         :nvig [C-tab] #'+workspace/switch-right)

        (:when (featurep! :completion company)
         :i "C-i" #'+company/complete)
        ;; multiedit
        (:when (featurep! :editor multiple-cursors)
         :nv "R"     #'evil-multiedit-match-all
         :n "C-n"    #'evil-multiedit-match-symbol-and-next
         :n "C-S-n"  #'evil-multiedit-match-symbol-and-prev
         :v "C-n"    #'evil-multiedit-match-and-next
         :v "C-S-n"  #'evil-multiedit-match-and-prev
         :nv "C-M-n" #'evil-multiedit-restore
         (:after evil-multiedit
          (:map evil-multiedit-state-map
           "n"       #'evil-multiedit-next
           "N"       #'evil-multiedit-prev
           "C-n"     #'evil-multiedit-match-and-next
           "C-S-n"   #'evil-multiedit-match-and-prev
           "V"       #'iedit-show/hide-unmatched-lines))
         ;; multiple cursors
         (:prefix ("gz" . "evil-mc")
          :nv "n" #'evil-mc-make-and-goto-next-match
          :nv "N" #'evil-mc-make-and-goto-prev-match
          :nv "d" #'evil-mc-make-and-goto-next-cursor
          :nv "D" #'evil-mc-make-and-goto-last-cursor
          :nv "p" #'evil-mc-make-and-goto-prev-cursor
          :nv "P" #'evil-mc-make-and-goto-first-cursor))
        ;; wgrep
        (:when (featurep! :completion ivy)
         (:map ivy-minibuffer-map
          (:prefix "C-c"
           :desc "Edit and replace"  "e" #'+ivy/woccur)))
        (:when (featurep! :editor lispy)
         (:map (lispy-mode-map lispy-mode-map-evilcp lispy-mode-map-lispy)
          "[" nil
          "]" nil)
         (:map lispyville-mode-map
          :n "M-[" #'lispy-backward
          :n "M-]" #'lispy-forward)))

(map! :leader
      :desc "Search project"         "/"    #'+default/search-project
      :desc "Visual expand"          "v"    #'er/expand-region

      (:prefix ("w" . "window")
       :desc "Switch to last window" "w"    #'evil-window-mru)

      (:prefix ("b" . "buffer")
       :desc "Fallback buffer"        "h"   #'+doom-dashboard/open
       :desc "Messages buffer"        "m"   #'view-echo-area-messages
       :desc "ibuffer (other window)" "I"   #'ibuffer-other-window)

      (:prefix ("f" . "file")
       :desc "find file new window"   "F"   #'find-file-other-window)

      (:when (featurep! :emacs undo +tree)
       :desc "Undo tree"              "U"   #'undo-tree-visualize)

      (:when (featurep! :ui treemacs)
       :desc "Project sidebar"        "0"   #'+treemacs/toggle)

      (:when (featurep! :ui workspaces)
       (:prefix "TAB"
        :desc "Main workspace"       "`"    #'+workspace/switch-to-0
        :desc "Previous workspace"   "TAB"  #'+workspace/other
        :desc "Forward frame"        "f"    #'+evil/next-frame
        :desc "Backward frame"       "F"    #'+evil/previous-frame))

      (:when (featurep! :completion ivy)
       :desc "Ivy M-x"                "SPC" #'counsel-M-x))
